["I think it's the perfect cream for us men!\n\nThank you for this!", "I use NIVEA cream for over 50 years and wanted to try something new.\nWhat is there in the box has not much, watery consistency and a cheaper smell with care to do, if the can be described as such at all.\n\nI still got the best cream without the bells and whistles.\n\nMfG Norbert B.\n", "The cream is top. The consistency is just pointed and immediately retracts. The scent is beautiful male. The design is really first class. Am super satisfied. I buy again!", "My husband hates everything looks like cream on the body, especially in the face - but he really likes this cream designed specifically for men!\nEven my grandchildren sons I gave already a box and you were amazed at just how enthusiastic because the cream does not stick and is absorbed quickly.", "Is compared to the conventional NC now the scent produced more pleasant ", "I'm totally as a crème ring thrilled by this cream.\nCan be super, quickly absorbed and smells just right.\nAnd the box is a Catcher of course.\nBut for traveling, a tube would be still more practical.\nIn particular for laying in the car please with supplies very soon!\n\n", "The cream smells tool, absorbs quickly and is not as \"greasy\" on the skin when they. Unfortunately, a star must I for the Verpacung abziehen...eine bottle would be nice since the Chreme rather reminiscent of lotion Nivea as to Nivea cream.", "The cream was first used, and must say that immediately attracts the cream smells very good and very pleasant to the touch. So Nieve", "The effect is wonderful.\nThe humidity also.\nI use this cream only on my feet but dieHaut feels wonderfully maintained, tends not is also not greasy.\nThe scent is gorgeous male, remains on the skin but discreet, and not intrusive.\nBut now to a point which I never thought possible, as it was in the advertising that should quickly insert this cream thought I jaja advertising blabla and that is normally quickly (Niveaproduckte move by the way anyway quickly) I had to but determine that it's actually true, I've never had a cream which is absorbed so quickly, that then also tested there the same result on other body parts.\nThe price is a little high but perhaps it is Yes the packaging that makes a little more expensive the product? To the right. Otherwise, a euro would have been less perfectly.\nBut how is the nu packaging? I must say that Beiersdorf here real time something is made here, it is not a simple packaging, but to what has thinking, preferably I would not throw away the empty packaging because I really like this, but one is yes no Messie that justifies the slightly too high price of such a box is a little more complex then again.\nThe handling is very easy.\nI use the product since its launch and will continue using it anyway.\nAs a pack of long enough I can not say unfortunately, but she goes with me at least a month.", "Product with large advertising effort on the market brought and then bought by me.\nThen what to read in the list of ingredients? Methylparaben. Parabens are suspected to be carcinogenic. More than a weak picture for a very well-known cosmetics companies.\nAnd to prevent equal to the alleged against reasoning: even if such an impact concentration occurring in this cream not scientifically be proven, suspicion is enough and the customer decides, not the marketing department. The competitors in the market can it better and use no parabens.\nConclusion: Annoying for an otherwise not bad product. Down in the bin.\n", "I am using the Nivea men cream since she came on the market. \nFirst thought was finally a cream for us men after I use it regularly for my face, hands and body from time to time. Also the smell tells to very me, not too intrusive but male. \n\nZiehtt a super fast and especially my face is soft throughout the day and maintained...\nSo love men, buy buy buy ", "The men's Nivea cream is the best thing I've ever tried.\nThe cream is super to apply on the skin, absorbs quickly and leaves skin feeling with, coupled with a sensational scent.\nThe attractive design of the box mean round positive experiences down.\n\nAm absolutely delight of men Nivea cream and can only each share.", "This cream for men is just awesome. It is easy to smudge, absorbs quickly and has a very masculine scent. The very beautiful design Dose...nicht only for men is more appealing.\nTOP Produkt...ich have repeatedly given it away and gotten only positive reactions", "This Nivea cream is really recommended for men. You wont, moisturizes, lets super to pass, quickly and can be applied for the body, face and hands. So you need not 3 creams, but has one for everything. The scent is male and very comfortable. I can recommend anyone buying and also all women as a gift for their husbands. As a woman, she has convinced me and my husband anyway. ", "The cream is really very good. Texture and the typical Nivea scent (slightly masculine) are optimal. Well suited for Eincrem muffle.", "My husband has used soft until I brought him the Nivea men care always my Nivea!\nHe describes it as follows: super fast moves, not greasy, smells like MEGA, low dosage, also super in a three day beard ;-)", "Best man cream that I have ever bought... only continue to recommend! ", "Great product for men. The cream is absorbed very quickly (which is very very important for me), smells good and not greasy. Impossible to imagine from my bathroom.", "My husband and my sons use this cream. Are very excited. She maintains good and it leaves no greasy film. \"Man\" should try it. ", "Super properties. More effective than the normal Niveacreme. This cream is recommended for men and women.", "I've tried the cream out of curiosity, I think she's super, also the fragrance is good. I now also regularly use it for my hands.", "I bought the cream for my husband and we are very excited! Before we tried quite a few already, because my husband tends to skin irritation, often with the result that the skin looked greasy and was still red spots.\nHere an improvement to see was the same at the 1st application and every day the skin relaxed looks, the irritations are gone and it no longer shines as she moves really fast. Can recommend one (s) only!", "By a longer hospital stay, my husband had a dry, scaly skin. He finds this cream super, because the same relaxed skin for the first time. Meanwhile, he has found that the cream is also wonderful for hands.", "Great, I've waited for this cream. Delicious scent, absorbs quickly and non-greasy. Thank you!!", "I bought this cream my friend and \"forced him\" to use... and behold, he's thrilled! Smell great, effect I happy great :)", "I bought the new Nivea men cream for my husband. He is totally thrilled, absorbs quickly and has a subtle fragrance.\nI like the fragrance very well, I like it when he uses the cream.", "My husband uses all products from Nivea.Von of the new cream that I brought him, he is thrilled. You is so pretty quickly into the skin. My husband takes a shower in the company and is pleased that he must take with only a cream for everything. He is just awesome. With kind regards Michaela Kerkhoff", "I have my cream a lazy man the new NIVEA men bought and first the typical... I need not... belongs. But then he tested them of course and behold, now he uses them with enthusiasm :) Conclusion it smells very good but not intrusive, absorbs quickly (what very says to my husband because he previously said each cream \"sticks\" and takes forever until she takes a), his skin (who could really tolerate humidity) is within super maintained a few days, the cream is also for sensitive skin perfectly compatible... And besides, the box looks really chic... So each has its own cream and other bad men nursing will find some real man cream class... Nice skin and the associated maintenance is not only women's business all-rounder a simple uncomplicated perfect men care! Thank you NIVEA ", "My friend bought this cream for his occasionally harsh hands. He was skeptical at first, but now he uses it regularly. The scent is totally comfortable and according to his testimony, this cream is super good and sticks. Absolutely top!", "My husband bought the cream. He was first skeptical. Now is already the next box. Super care, great scent, great.", "I bought the cream and was immediately satisfied. Especially my bald now feels like a Kinderpopo.", "my man begeistert.die is cream absorbs quickly, leaving skin feeling a very good, is economical in the consumption, non-greasy and donates Feuchtigkeit.sie is used daily and is so far the best cream for männerhaut.der perfume is discreet and pleasant and we felt equal to the effect that skin to the given skin wird.die feels softer and spans not more. ", "Brought for my husband the Nivea men cream. He used never face cream, but that he was then good. I confess I take now and again some of it, it smells just devastatingly good!", "My husband is thrilled and now he always does that. He was thus a lotion muffle, but now no longer", "A super cream, usual Nivea quality and now also with \"male\" fragrance! Just super, suitable also for beard. Absorbs quickly and leaves a super soft skin feel.  Long-lasting moisture! \nNow is my first Nivea product! TOP +", "This new cream is not only for men. The consistency is great, and the whole family loves the scent. I love to use them as hand cream and made them even as body lotion. Absorbs quickly and the scent and long an...so man / woman has what of it.", "My husband has a very dry facial skin. Soon after the first cream, the skin was smooth and 'baby tender'. The aroma is very pleasant and not too dominant. The cream is absorbed quickly and not to greasy. A great product, I will buy again in any case.\n", "Care may be not expensive and my husband likes also no strong scent.\n\nThe cream has a pleasant, soft texture, does not burn after shaving and maintains throughout the day.\n\nHe has soft used the Nivea cream, but now he wants to make.", "I gave this cream my Dad for his birthday and he was more excited than by all other things from this 'trifle'!\nSo easy you can make joy.\nHe was always a big fan of Nivea and this cream that nourishes the body and also more pleasant smell, is quite to his liking.\nMy brother loved it and bought itself also directly!\nAnd we women have our joy, when the men are well maintained and good smell.", "My husband was a cream a person so far. Since I have given him the men of Nivea cream he is fully excited. You is quickly absorbed and smells great.\nA fan!", "a friend of mine, which I which cream gave, is absolutely thrilled! It absorbs quickly, non-greasy, maintains good and smells male.\nvery much recommended!", "I am totally thrilled by the cream she absorbed very quickly and it smells very pleasant and not forgetting you non-greasy. My husband like her a lot. ", "This cream for men is really wow! Finally my husband no longer smells after baby's bottom, but nicely herb male. So be it. And his skin is pleased also!", "The cream has a pleasant scent and is really quickly. Important for men who themselves don't like cream, since they also not applied a look this :-) I think my husband will get accustomed fast finally time to do something good for his skin.", "That the cream has a light texture, it is ideal for the 3-day-beard of my husband's. It spreads well and smells 'male'. ", "The Nivea men I had brought just cream my husband a few days ago.\nHe is actually so no type as regards creams. But even he is excited by this.\nHe uses them even twice a day so he's happy.\nSo I did everything right and the cream is absolutely worth their money.\nWhat you want more than a very satisfied husband who is now also like to eincremt! :-) \nCan the Nivea men only recommend cream.\n", "I was allowed to do a product review of NIVEA and in the package was a sample of NIVEA MEN cream. My husband was very pleased to do with testing and was / is absolutely thrilled by this great cream. He has completely changed his toiletries on NIVEA, what buy me very relieved. He is also busy most recommend. We can only say... NIVEA is the Nr. 1 with us :-)", "My father is a man - men creams don't do that since my father now doesn't his cream after \"Girl\" smells and not apply and \"sticks\"-is now a daily ritual in the box to access 😉", "I had a small Tin \"Nivea men cream in my Ambassador test package for\"Nivea care\"which is indeed excellent and my almost 18-year-old son, was so enthusiastic that he used nothing more.\nHe says his skin has become top and even his pimples be gone back.\n\nToo bad only, that's the ' NIvea men cream \"is not even in smaller doses. Would be ideal on the road.", "After my husband constantly so praised manifested itself about this cream, which, by the way, the Easter Bunny hid him, I've been busy me times itself more intense... She's so pleasantly moist and the consistency is super comfortable and the scent as refreshing, just male.  Now I can understand why my husband finally regularly resorts to the cream pot. So far, I had much of a chance that my husband used his skin so permanently. A really great product!", "Finally I found the right face cream for my husband. It's like normal Nivea cream, but it smells of \"Man\".", "When I read of the new cream for men, I worried this cream is my treasure and give the children to the father's day can be. In advertising, I had to chuckle just in the name of \"the cream\". My husband was eyeing me critically, why he should then take a cream, but only for women. And now he is so enthusiastic, that one had to think just a stock of 2 bottles in the Cabinet. The cream is easy to apply, smells great and moisturises the skin optimally. Just to recommend. ", "Nivea men in the good for me Box von Rossmann contain. \nI've passed this at home. My father & brother both are very enthusiastic about it because the cream shows long effect and nourishes dry skin without fat forever long to. She also has a very gentle but masculine scent which just only very well. So I taster's pleasure at the two. Thumbs up!", "I find that the cream is good but unfortunately not great smells.", "I gave my son the cream. He found it very good. For on the go, a tube would be ideal. It is simply more hygienic.", "I'm from the cream begeistert...denn my friend used it! He may not quite like the scent but I like him all the more ;)", "I could interest neither my friend nor my son in the cream. Both found that she are not well absorbed and especially stinks. You would never buy them! We all find that it smells like \"old man\".", "Parabens, silicones and paraffins.\r\nYou can't!\r\nSo many bad ingredients in the cream. The idea with the EMPA men series is good, not come but unfortunately for my husband in question. Organic cosmetics from Nivea, please! More and more people pay attention.\r\nThank you", "Usually uses my friend no cream, but the he was thrilled. You not female scent and can be spread well. Its not stuck and the cream has no fat layer behind let", "My friend was real excited by the cream, in his opinion, had spread well and moved relatively quickly. His skin feels much smoother after a few days of use. Only the lid was probably a challenge with creamy, great hands.", "This cream the Ambassador action have included get and give it to my husband and I must say: it smells very good :) In addition, he is also very satisfied and applies to almost every day in the face. Previously he used Nivea soft.", "Slightly sticky at first, smells quite Lemony, will probably also again to soft return.", "4 cans bought for 80cent of less so in the DM, and Yes, the can but by the consistency is class of cream, überarbeitbar, as she slips a hand or to not longer good to install the lid after applying the lotion. All in all, I like the cream :-)", "Unfortunately leaves a light lubricating film on the skin. Takes something until the is retracted. Stay well with the proven NIVEA soft, although that is not quite as male. ;)", "I super like this product! Feels great on the skin and it works for a few seconds!"]